"1. Напишите программу, которая принимает на вход два числа и проверяет, является ли одно число квадратом другого."

"Это сделал я "  "** 2 - в квадрате"
number1 = int(input())
number2 = int(input())
if number2 == number1 ** 2 or number1 == number2 ** 2:
    print('Yes')
else:
    print('No')
    print('No')